In [44]:
#import all libraries needes for this one 
#import specific library function
from pandas import DataFrame, read_csv
#import pandas
import pandas as pd
#for check python version
import sys

In [12]:
#check python and pandas version
print('python version ' + sys.version)
print('python version' + pd.__version__)

python version 3.7.0 (default, Jun 28 2018, 08:04:48) [MSC v.1912 64 bit (AMD64)]
python version0.23.4

In [92]:
names = ['Guru','Jolly','Marycom','Johnnathan','Santosh']
email = ['Gru@gmail.com','Jlly@gmail.com','Mcom@yahoo.com','John@outlook.com','Stosh@gmail.com']
city =  ['Pune','New delhi','Mumbai','NewYork','Punjab']
department = ['IT','Salesman','Developere','Testing','Management']
salary = ['35000','36500','65000','58692','35629']

In [93]:
#creating DataSet (Person)

In [96]:
PersonDataSet = list(zip(names,email,city,department,salary))
PersonDataSet

[('Guru', 'Gru@gmail.com', 'Pune', 'IT', '35000'),
 ('Jolly', 'Jlly@gmail.com', 'New delhi', 'Salesman', '36500'),
 ('Marycom', 'Mcom@yahoo.com', 'Mumbai', 'Developere', '65000'),
 ('Johnnathan', 'John@outlook.com', 'NewYork', 'Testing', '58692'),
 ('Santosh', 'Stosh@gmail.com', 'Punjab', 'Management', '35629')]

In [97]:
df = pd.DataFrame(data = PersonDataSet, columns=['Name', 'Email', 'City','Department','Salary' ])
df

         Name             Email       City  Department Salary
0        Guru     Gru@gmail.com       Pune          IT  35000
1       Jolly    Jlly@gmail.com  New delhi    Salesman  36500
2     Marycom    Mcom@yahoo.com     Mumbai  Developere  65000
3  Johnnathan  John@outlook.com    NewYork     Testing  58692
4     Santosh   Stosh@gmail.com     Punjab  Management  35629

In [98]:
df.to_csv('Personinfo.csv',index=False,header=False)

In [86]:
Location= r'C:\Users\RamaKrishna\Personinfo.csv'
df = pd.read_csv(Location)

In [99]:
df

         Name             Email       City  Department Salary
0        Guru     Gru@gmail.com       Pune          IT  35000
1       Jolly    Jlly@gmail.com  New delhi    Salesman  36500
2     Marycom    Mcom@yahoo.com     Mumbai  Developere  65000
3  Johnnathan  John@outlook.com    NewYork     Testing  58692
4     Santosh   Stosh@gmail.com     Punjab  Management  35629

In [ ]:
#df = pd.read_csv(Location, header=None)
#df

In [100]:
df = pd.read_csv(Location, header=None)
df

            0                 1          2           3      4
0        Guru     Gru@gmail.com       Pune          IT  35000
1       Jolly    Jlly@gmail.com  New delhi    Salesman  36500
2     Marycom    Mcom@yahoo.com     Mumbai  Developere  65000
3  Johnnathan  John@outlook.com    NewYork     Testing  58692
4     Santosh   Stosh@gmail.com     Punjab  Management  35629

In [108]:
df = pd.read_csv(Location, names=['Names','Contact','City','Department','Salary '])
df

        Names           Contact       City  Department  Salary
0        Guru     Gru@gmail.com       Pune          IT    35000
1       Jolly    Jlly@gmail.com  New delhi    Salesman    36500
2     Marycom    Mcom@yahoo.com     Mumbai  Developere    65000
3  Johnnathan  John@outlook.com    NewYork     Testing    58692
4     Santosh   Stosh@gmail.com     Punjab  Management    35629

In [50]:
#for delete the csvfile
#import os
#os.remove(Location)

In [109]:
df.dtypes

Names         object
Contact       object
City          object
Department    object
Salary         int64
dtype: object

In [55]:
# Check data type of Births column
#df.Births.dtype

In [113]:
df.City.dtype

dtype('O')

In [59]:
# Method 1:
#Sorted = df.sort_values(['Births'], ascending=False)
#Sorted.head(1)

In [138]:
Sorted = df.sort_values(['City'], ascending=True)
Sorted.head(5)

        Names           Contact       City  Department  Salary
2     Marycom    Mcom@yahoo.com     Mumbai  Developere    65000
1       Jolly    Jlly@gmail.com  New delhi    Salesman    36500
3  Johnnathan  John@outlook.com    NewYork     Testing    58692
0        Guru     Gru@gmail.com       Pune          IT    35000
4     Santosh   Stosh@gmail.com     Punjab  Management    35629

In [131]:
Sorted =df.sort_values(['Department'], ascending=False)
Sorted.head(5)

        Names           Contact       City  Department  Salary
3  Johnnathan  John@outlook.com    NewYork     Testing    58692
1       Jolly    Jlly@gmail.com  New delhi    Salesman    36500
4     Santosh   Stosh@gmail.com     Punjab  Management    35629
0        Guru     Gru@gmail.com       Pune          IT    35000
2     Marycom    Mcom@yahoo.com     Mumbai  Developere    65000